dejmekz/irrigation-system/ESP32/src/main.cpp
    if (WiFi.status() == WL_CONNECTED)
    {
        if (!wifiWasConnected)
        {
            // Connection just restored
            lcdLine(1, " WiFi connected ");
            log_i("WiFi connected");
            wifiWasConnected = true;
            wifiStableAt = millis();
        }
        // Only clear the safety timer after the link has been up for 5 s
        if (wifiStableAt != 0 && millis() - wifiStableAt >= 5000)
            wifiLostAt = 0;
    }
    else
    { // WiFi disconnected
        if (wifiWasConnected)
        {
            wifiWasConnected = false;
            wifiStableAt = 0;
        }

        // Arm safety timer immediately on first disconnected loop tick
        if (wifiLostAt == 0)
            wifiLostAt = millis();

        // Security watchdog: stop everything if WiFi has been gone too long while active
        if (anyActive() && millis() - wifiLostAt >= WIFI_ACTIVE_SAFETY_MS)
        {
            allOff(); // Emergency stop
            snprintf(pcfErrMsg, sizeof(pcfErrMsg), " WiFi lost! Stopped ");
            pcfErrFor(5000);
            wifiLostAt = millis(); // restart timer so repeated checks don't re-trigger
            log_e("WiFi lost while watering — all outputs stopped");
        }

        // --- 2. Connection Retry ---
        static unsigned long lastWifiRetry = 0;
        if (millis() - lastWifiRetry > WIFI_RETRY_INTERVAL_MS)
        {
            lastWifiRetry = millis();
            log_w("WiFi lost, reconnecting...");
            WiFi.begin(WIFI_SSID, WIFI_PASS);
        }
    }

    // --- 3. MQTT LOOP + WATCHDOG ---
    if (WiFi.status() == WL_CONNECTED && mqtt.connected())
        mqtt.loop();

    if (WiFi.status() == WL_CONNECTED && !mqtt.connected())
    {
        static unsigned long lastMqttRetry = 0;
        if (millis() - lastMqttRetry > MQTT_RETRY_INTERVAL_MS)
        {
            lastMqttRetry = millis();
            log_w("MQTT lost, reconnecting...");
            mqttReconnect();
        }
    }

    // Retry any relay write the I2C bus rejected, until it lands. Throttled so a
    // genuinely dead bus is not hammered at full loop speed.
    static unsigned long lastPcfRetry = 0;
    if ((pcfDirty[0] || pcfDirty[1]) && millis() - lastPcfRetry >= 1000)
    {
        lastPcfRetry = millis();
        for (int i = 0; i < 2; i++)
            if (pcfDirty[i] && pcfFlush(i))
            {
                pcfDirty[i] = false;
                syncValvesFromShadow(i);
                log_i("PCF[%d] write recovered - relay state applied", i);
            }
    }

    // Valve max-open safety — the last-resort dead-man's switch. Unlike the WiFi
    // and pump watchdogs below this fires even when WiFi, MQTT and the pump are
    // all healthy, so a crashed or hung Pi cannot leave a valve open forever.
    bool safetyClosedValve = false;
    for (int b = 0; b < NUM_BOXES; b++)
        for (int v = 0; v < VALVES_PER_BOX; v++)
            if (valveOn[b][v] && millis() - valveOnAt[b][v] >= VALVE_MAX_ON_MS)
            {
                setValve(b + 1, v + 1, false);
                valveLatched[b][v] = true;   // must be set after the OFF clears it
                safetyClosedValve = true;
                log_e("Valve B%d:V%d open > %lu min - closed by safety timer",
                      b + 1, v + 1, VALVE_MAX_ON_MS / 60000UL);
            }

    if (safetyClosedValve)
    {
        snprintf(pcfErrMsg, sizeof(pcfErrMsg), "Valve max time stop!");
        pcfErrFor(5000);
        // Don't leave the pump running dry once the safety timer took the last
        // valve away. Only on this path — a pump legitimately runs with no valve
        // open during a script's configured pump start delay.
        if (pumpOn && !anyValveOpen())
        {
            setPump(false);
            log_e("Pump stopped: last valve was closed by the safety timer");
        }
    }

    // Pump safety: stop pump AND all valves if no valve ON command for 30 minutes
    if (pumpOn && millis() - lastValveActivityAt >= PUMP_SAFETY_TIMEOUT_MS)
    {
        allOff();
        if (mqtt.connected())
            publishAllState();
        snprintf(pcfErrMsg, sizeof(pcfErrMsg), "Pump safety stop!");
        pcfErrFor(5000);
        log_e("Pump safety stop: no valve ON for %lu min — all outputs off",
              PUMP_SAFETY_TIMEOUT_MS / 60000UL);
    }

    // Publish hw_status immediately when a device goes offline or recovers
    if (hwStatusDirty && mqtt.connected())
    {
        publishHwStatus();
        hwStatusDirty = false;
    }

    // Periodic RTC re-probe — detect runtime failures / hot-plug recovery
    static unsigned long lastRtcProbe = 0;
    if (millis() - lastRtcProbe >= 60000UL)
    {
        lastRtcProbe = millis();
        Wire.beginTransmission(RTC_I2C_ADDR);
        bool ok = (Wire.endTransmission() == 0);
        if (ok != rtcOk)
        {
            rtcOk = ok;
            hwStatusDirty = true;
        }
    }

    // Heartbeat every 5 minutes
    static unsigned long lastHeartbeat = 0;
    if (millis() - lastHeartbeat >= HEARTBEAT_INTERVAL_MS)
    {
        lastHeartbeat = millis();
        publishHeartbeat();
    }

    // Update LCD every second
    static unsigned long lastLCD = 0;
    if (millis() - lastLCD >= 1000)
    {
        lastLCD = millis();
        updateLCD();
    }
}
